In [16]:
import pandas as pd
#holidays_events table
df = pd.read_csv('C:/Users/Royaa/Downloads/archive (2)/holidays_events.csv')
df.head()

,date,type,locale,locale_name,description,transferred
0,2012-03-02,Holiday,Local,Manta,Fundacion de Manta,False
1,2012-04-01,Holiday,Regional,Cotopaxi,Provincializacion de Cotopaxi,False
2,2012-04-12,Holiday,Local,Cuenca,Fundacion de Cuenca,False
3,2012-04-14,Holiday,Local,Libertad,Cantonizacion de Libertad,False
4,2012-04-21,Holiday,Local,Riobamba,Cantonizacion de Riobamba,False

In [2]:
df.isnull().sum()

date           0
type           0
locale         0
locale_name    0
description    0
transferred    0
dtype: int64

In [22]:
#items table
items = pd.read_csv('C:/Users/Royaa/Downloads/archive (2)/items.csv')
items.head()

   item_nbr        family  class  perishable
0     96995     GROCERY I   1093           0
1     99197     GROCERY I   1067           0
2    103501      CLEANING   3008           0
3    103520     GROCERY I   1028           0
4    103665  BREAD/BAKERY   2712           1

In [4]:
items.shape

(4100, 4)

In [5]:
items.isnull().sum()

item_nbr      0
family        0
class         0
perishable    0
dtype: int64

In [20]:
#oil table
oil = pd.read_csv('C:/Users/Royaa/Downloads/archive (2)/oil.csv')
oil.head()

         date  dcoilwtico
0  2013-01-01         NaN
1  2013-01-02       93.14
2  2013-01-03       92.97
3  2013-01-04       93.12
4  2013-01-07       93.20

In [7]:
oil.isnull().sum()

date           0
dcoilwtico    43
dtype: int64

# filling missing values in oil table

In [21]:
#oil = oil.fillna(method='bfill') 
oil = oil.bfill()
oil

            date  dcoilwtico
0     2013-01-01       93.14
1     2013-01-02       93.14
2     2013-01-03       92.97
3     2013-01-04       93.12
4     2013-01-07       93.20
...          ...         ...
1213  2017-08-25       47.65
1214  2017-08-28       46.40
1215  2017-08-29       46.46
1216  2017-08-30       45.96
1217  2017-08-31       47.26

[1218 rows x 2 columns]

In [13]:
oil.isnull().sum()

date          0
dcoilwtico    0
dtype: int64

In [37]:
df.to_csv('C:/Users/Royaa/Downloads/archive (2)/oil_cleaned.csv', index=False)

In [15]:
sample_submission = pd.read_csv('C:/Users/Royaa/Downloads/archive (2)/sample_submission.csv')
sample_submission.head()

          id  unit_sales
0  125497040           0
1  125497041           0
2  125497042           0
3  125497043           0
4  125497044           0

In [17]:
sample_submission.isnull().sum()

id            0
unit_sales    0
dtype: int64

In [18]:
sample_submission.shape

(3370464, 2)

In [24]:
sample_submission['unit_sales'].value_counts()

unit_sales
0    3370464
Name: count, dtype: int64

In [25]:
stores = pd.read_csv('C:/Users/Royaa/Downloads/archive (2)/stores.csv')
stores.head()

   store_nbr           city                           state type  cluster
0          1          Quito                       Pichincha    D       13
1          2          Quito                       Pichincha    D       13
2          3          Quito                       Pichincha    D        8
3          4          Quito                       Pichincha    D        9
4          5  Santo Domingo  Santo Domingo de los Tsachilas    D        4

In [26]:
stores.isnull().sum()

store_nbr    0
city         0
state        0
type         0
cluster      0
dtype: int64

In [27]:
test = pd.read_csv('C:/Users/Royaa/Downloads/archive (2)/test.csv')
test.head()

          id        date  store_nbr  item_nbr  onpromotion
0  125497040  2017-08-16          1     96995        False
1  125497041  2017-08-16          1     99197        False
2  125497042  2017-08-16          1    103501        False
3  125497043  2017-08-16          1    103520        False
4  125497044  2017-08-16          1    103665        False

In [28]:
test.isnull().sum()

id             0
date           0
store_nbr      0
item_nbr       0
onpromotion    0
dtype: int64

In [35]:
transactions = pd.read_csv('C:/Users/Royaa/Downloads/archive (2)/transactions.csv')
transactions.head()

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

In [36]:
transactions.isna().sum()

date            0
store_nbr       0
transactions    0
dtype: int64